; Установка значений, чтобы было видно эффект программы
MOV 48, #1
MOV 49, #2
MOV 50, #3
MOV 51, #4
MOV 52, #5
MOV 53, #6
MOV 54, #7
MOV 55, #8
MOV 56, #9
MOV 57, #10

; Установка значений для цикла, 
; R0 – Адрес текущей ячейки РПД
; R1 – Счётчик итераций цикла
MOV R0,#48
MOV R1,#10
cycle:
call ONESEC ; Вызов функции задержки
MOV P1,@R0 ; В порт переносится значение по адресу из R0
DEC R1 ; Значение количества оставшихся итераций цикла уменьшается на 1
INC R0 ; Адрес в регистре увеличивается на 1 для взятия следующего значения

MOV A,R1 ; Перенос в аккумулятор значения счётчика для проверки
JNZ cycle ; Переход в начало цикла, если счётчик не нулевой

jmp $ ; Зацикливание программы после выполнения
DELAY: 
	MOV R2,#250; Загрузка X, слагаемое А
LOOPEX: 
	MOV R3,#198 ; Загрузка Y, слагаемое Бу
LOOPIN:
	DJNZ R3,LOOPIN ; Декремент R2 (Y) и запускает вн. цикл если R2 не нулевое, множитель Ку

	DJNZ R2,LOOPEX ; Декремент R1 (X) и запуск внешнего цикла если R1 не нулевое, слагаемое Бх

	MOV R3,#125 ; Точная подстройка, строка ниже её выполняет, слагаемое На
LOOPAD:
	DJNZ R3, LOOPAD ; Временная задержка, множитель К
	NOP
RET


ONESEC:
	MOV A,#10 ; Загрузка числа вызовов подпрограммы задержки на 100 мс
LOOP: 
	CALL DELAY ; Задержка 100 мс
	DJNZ A, LOOP ; Декремент А и цикл если не нулевое
RET
